CSI API ETABS v1
cCombo.SetCaseList_1 Method
 Adds or modifies one load case or response combination in the list of cases included in the load combination specified by the Name item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetCaseList_1(
	string Name,
	ref eCNameType CNameType,
	string CName,
	int ModeNumber,
	double SF
)
Function SetCaseList_1 (
	Name As String,
	ByRef CNameType As eCNameType,
	CName As String,
	ModeNumber As Integer,
	SF As Double
) As Integer
Dim instance As cCombo
Dim Name As String
Dim CNameType As eCNameType
Dim CName As String
Dim ModeNumber As Integer
Dim SF As Double
Dim returnValue As Integer
returnValue = instance.SetCaseList_1(Name,
	CNameType, CName, ModeNumber, SF)
int SetCaseList_1(
	String^ Name,
	eCNameType% CNameType,
	String^ CName,
	int ModeNumber,
	double SF
)
abstract SetCaseList_1 :
        Name : string *
        CNameType : eCNameType byref *
        CName : string *
        ModeNumber : int *
        SF : float -> int
Parameters
Name
Type: System.String
 The name of an existing load combination.
CNameType
Type: ETABSv1.eCNameType
 This is one of the following items in the eCNameType enumeration:
LoadCase = 0
LoadCombo = 1
 This item indicates whether the CName item is an analysis case (LoadCase) or a load combination (LoadCombo).
CName
Type: System.String
 The name of the load case or load combination to be added to or modified in the combination specified by the Name item. If the load case or combination already exists in the combination specified by the Name item, the scale factor is modified as indicated by the SF item for that load case or combination. If the analysis case or combination does not exist in the combination specified by the Name item, it is added.
ModeNumber
Type: System.Int32
 The mode number for the case indicated by the CName item. This item applies when by the CNameType item is LoadCase and the type of load case specified by the CName item is either Modal or Buckling. Any other case type or combo should specify a zero for this item.
SF
Type: System.Double
 The scale factor multiplying the case or combination indicated by the CName item.
Return Value
Type: Int32
 Returns zero if the item is successfully added or modified, otherwise it returns a nonzero value.
Remarks
 This function supersedes SetCaseList(String, eCNameType, String, Double)
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add combo
       ret = SapModel.RespCombo.Add("COMB1", 0)
   'add load case to combo
       ret = SapModel.RespCombo.SetCaseList("COMB1", eCNameType.LoadCase, "DEAD", 0, 1.4)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cCombo Interface
ETABSv1 Namespace